// Напишіть функцію sum, яка б працювала так:

// sum(1)(2) == 3; // 1 + 2
// sum(1)(2)(3) == 6; // 1 + 2 + 3
// sum(5)(-1)(2) == 6
// sum(6)(-1)(-2)(-3) == 0
// sum(0)(1)(2)(3)(4)(5) == 15
// P.S. Підказка: вам може знадобитися налаштувати кастомний об’єкт, щоб конвертувати примітиви для вашої функції.
function sum(a) {
    let currentSum = a;
    function f(b) {
      currentSum += b;
      return f;
    }
    f.toString = function() {
      return currentSum;
    };
    return f;
  }


sum(1)(2) == 3;
console.log(sum(1)(2)(3) == 6); // true
sum(5)(-1)(2) == 6;
sum(6)(-1)(-2)(-3) == 0;
sum(0)(1)(2)(3)(4)(5) == 15;


