// Факторіал з натурального числа – це число, помножене на "число мінус один", потім на "число мінус два" і так до 1.
// Факторіал n позначається як n!
// Ми можемо написати визначення факторіалу наступним чином:
// n! = n * (n - 1) * (n - 2) * ...*1
// Значення факторіалів для різних n:
// 1! = 1
// 2! = 2 * 1 = 2
// 3! = 3 * 2 * 1 = 6
// 4! = 4 * 3 * 2 * 1 = 24
// 5! = 5 * 4 * 3 * 2 * 1 = 120
// Завдання полягає в тому, щоб написати функцію factorial(n),
// яка обчислює n! за допомогою рекурсивних викликів.
// alert( factorial(5) ); // 120
// P.S. Підказка: n! може бути записане як n * (n-1)!. 
// Наприклад: 3! = 3*2! = 3*2*1! = 6


function factorial(n){
    return n > 1 ?  n *= factorial(n - 1) : n;
}

alert( factorial(5) );