// Напишіть інтерфейс для створення списку на основі того, що введе користувач.

// Для кожного пункта списку:

// Запитайте текст пункту у користувача за допомогою prompt.
// Створіть <li> з цим текстом та додайте його до <ul>.
// Продовжуйте поки користувач не припинить вводити дані (натисне Esc або введе пустий рядок).
// Всі елементи повинні створюватися динамічно.

// Якщо користувач вводить HTML-теги, вони мають розглядатися як текст.


// ------------------------------------------------------------------------

let ul = document.createElement('ul');
let li = document.createElement('li');

document.body.append(ul);

function createLi () {
    let text = prompt('Write text');
    if(text != false &&  text != undefined){
        li.textContent = text;
        ul.prepend(li)
        createLi
    }
    return  
}

createLi()