// В прикладі нижче виклик table.remove() має видалити таблицю з документу.

// Але, якщо ви запустите код, то побачите, що текст "aaa" не зникає.

// Чому так відбувається?

// <table id="table">
//   aaa
//   <tr>
//     <td>Тест</td>
//   </tr>
// </table>

// <script>
//   alert(table); // таблиця, як і має бути

//   table.remove();
//    чому текст "ааа" залишився в документі?
// </script>

// ------------------------------------------------------------------------
// не правельно сформована таблиця 
