// Ось як має виглядати документ:


// Які координати центру поля?

// Обчисліть їх і використайте, щоб помістити м’яч у центр зеленого поля:


// Елемент має бути переміщено за допомогою JavaScript, а не CSS.
// Код повинен працювати з будь-яким розміром кулі (10, 20, 30 пікселів) і будь-якого розміру поля, ваше рішення не має залежити від якихось конкретних значень.
// P.S. Звичайно, центрування можна виконати за допомогою CSS, але тут нам потрібен саме JavaScript. Далі ми познайомимося з іншими темами та більш складними ситуаціями, коли необхідно використовувати JavaScript. Тут ми робимо “розминку”.




ball.style.left = Math.round(field.clientWidth / 2 - ball.offsetWidth / 2) + 'px';
ball.style.top = Math.round(field.clientHeight / 2 - ball.offsetHeight / 2) + 'px';