// Послідовність чисел Фібоначчі має формулу Fn = Fn-1 + Fn-2. 
// Іншими словами, наступне число є сумою двох попередніх.

// Перші два числа: 1, потім 2(1+1), потім 3(1+2), 5(2+3) і так
//  далі: 1, 1, 2, 3, 5, 8, 13, 21....

// Числа Фібоначчі пов’язані із золотим перетином і
//  багатьма природними явищами навколо нас.

// Напишіть функцію fib(n), яка повертає n-th число Фібоначчі.
// Приклад:

// function fib(n) { /* твій код */ }

// alert(fib(3)); // 2
// alert(fib(7)); // 13
// alert(fib(77)); // 5527939700884757
// P.S. Функція повинна бути швидкою. Виклик fib(77) має тривати не більше частки секунди

function fib(n) {
    let a = 1;
    let b = 1;
    for (let i = 3; i <= n; i++) {
        let c = a + b;
        a = b;
        b = c;
    }
    return b;
}
  

alert(fib(77));