// Напишіть функцію sumInput() яка:

// Просить користувача ввести дані за допомогою prompt та зберігає їх в масив.
// Закінчує робити запити в користувача після того, як введено не числове значення, порожня строка або натиснуто “відмінити”.
// Підраховує та повертає суму елементів масиву.
// P.S. Нуль 0 це – валідне число, будь ласка, не зупиняйте функцію при введені 0.
"use strict"
function sumInput() {
    let number = [];
    
    while (true) {
        let value = prompt("Введіть, будь ласка, номер", 0);

        // перевірка ведених даних
        if (value === "" || value === null || !isFinite(value)) break;
        number.push(+value);
    }
    let sum = 0;

    for (let num of number) {
        sum += num;
    }
    return sum;
}

alert( sumInput() );